xlloss/ble_uart_bridge/nRF5_SDK_12.3.0_d7731ad/examples/ble_central/ble_app_multilink_central/main.c
                    packet_data_cnt[ble_hd] = packet_data_cnt[ble_hd] + 1;
              }

              if (i + 2 < p_ble_nus_evt->data_len && packet_data_cnt[ble_hd] > 3) {
                packet_end[ble_hd][0] = p_ble_nus_evt->p_data[i + 0];
                packet_end[ble_hd][1] = p_ble_nus_evt->p_data[i + 1];
                packet_end[ble_hd][2] = p_ble_nus_evt->p_data[i + 2];
                
                if (packet_end[ble_hd][0] == '#' && packet_end[ble_hd][1] == '#' && packet_end[ble_hd][2] == '#') {
                  
                    err_code = app_fifo_put(&tx_fifo[ble_hd].tx_fifo_handle, '#');
                    if (err_code != NRF_SUCCESS) {
                      NRF_LOG_INFO("app_fifo_put fail ble_hd %d\r\n", ble_hd);
                      app_fifo_flush(&tx_fifo[ble_hd].tx_fifo_handle);
                      packet_data_cnt[ble_hd] = 0;
                      packet_head[ble_hd][0] = 0;
                      packet_head[ble_hd][1] = 0;
                      packet_head[ble_hd][2] = 0;
                      goto err_exit;
                    }

                    err_code = app_fifo_put(&tx_fifo[ble_hd].tx_fifo_handle, '#');
                    if (err_code != NRF_SUCCESS) {
                      NRF_LOG_INFO("app_fifo_put fail ble_hd %d\r\n", ble_hd);
                      app_fifo_flush(&tx_fifo[ble_hd].tx_fifo_handle);
                      packet_data_cnt[ble_hd] = 0;
                      packet_head[ble_hd][0] = 0;
                      packet_head[ble_hd][1] = 0;
                      packet_head[ble_hd][2] = 0;
                      goto err_exit;
                    }

                    packet_data_cnt[ble_hd] = packet_data_cnt[ble_hd] + 2;

                    NRF_LOG_INFO("!!! ble_hd %d!!!\r\n",  ble_hd);                    

                    err_code = app_fifo_put(&packet_data_tx_order_hd, ble_hd);
                    if (err_code != NRF_SUCCESS) {
                      NRF_LOG_INFO ("packet_data_tx_order_hd FIFO put FAIL\r\n");
                      app_fifo_flush(&tx_fifo[ble_hd].tx_fifo_handle);
                      packet_data_cnt[ble_hd] = 0;
                      packet_head[ble_hd][0] = 0;
                      packet_head[ble_hd][1] = 0;
                      packet_head[ble_hd][2] = 0;
                      goto err_exit;
                    }

                    err_code = app_fifo_put(&packet_data_tx_order_hd, ble_hd);
                    if (err_code != NRF_SUCCESS) {
                      NRF_LOG_INFO ("packet_data_tx_order_hd FIFO put FAIL\r\n");
                      app_fifo_flush(&tx_fifo[ble_hd].tx_fifo_handle);
                      packet_data_cnt[ble_hd] = 0;
                      packet_head[ble_hd][0] = 0;
                      packet_head[ble_hd][1] = 0;
                      packet_head[ble_hd][2] = 0;
                      goto err_exit;
                    }

                    err_code = app_fifo_put(&packet_data_tx_order_hd, ble_hd);
                    if (err_code != NRF_SUCCESS) {
                      NRF_LOG_INFO ("packet_data_tx_order_hd FIFO put FAIL\r\n");
                      app_fifo_flush(&tx_fifo[ble_hd].tx_fifo_handle);
                      packet_data_cnt[ble_hd] = 0;
                      packet_head[ble_hd][0] = 0;
                      packet_head[ble_hd][1] = 0;
                      packet_head[ble_hd][2] = 0;
                      goto err_exit;
                    }

                    packet_data_cnt[ble_hd] = 0;
                    packet_head[ble_hd][0] = 0;
                    packet_head[ble_hd][1] = 0;
                    packet_head[ble_hd][2] = 0;

                    if (tx_order_index_buy >= TX_ORDER_NUM) {
                      tx_order_index_buy = 0;
                    }
                }
              }
            }
err_exit:
            break;

        case BLE_NUS_C_EVT_DISCONNECTED:
            NRF_LOG_INFO("Disconnected\r\n");
            scan_start();
            break;
    }
}


/**@snippet [Handling the data received over UART] */
void uart_event_handle(app_uart_evt_t * p_event)
{
    /* static uint8_t data_array[BLE_NUS_MAX_DATA_LEN]; */
    /* static uint8_t index = 0; */
    /* uint32_t       err_code; */

    switch (p_event->evt_type)
    {
        case APP_UART_DATA_READY:
          /*
						NRF_LOG_INFO("\r\nAPP_UART_DATA_READY\r\n");
            UNUSED_VARIABLE(app_uart_get(&data_array[index]));
            index++;

            if ((data_array[index - 1] == '\n') || (index >= (BLE_NUS_MAX_DATA_LEN)))
            {
                err_code = ble_nus_string_send(&m_nus, data_array, index);
                if (err_code != NRF_ERROR_INVALID_STATE)
                {
                    APP_ERROR_CHECK(err_code);
                }

                index = 0;
            }
          */
            break;

        case APP_UART_COMMUNICATION_ERROR:
            APP_ERROR_HANDLER(p_event->data.error_communication);
            break;

        case APP_UART_FIFO_ERROR:
            NRF_LOG_INFO ("!!!!!APP_UART_FIFO_ERROR\r\n");
            APP_ERROR_HANDLER(p_event->data.error_code);
            break;

        default:
            break;
    }
}
/**@snippet [Handling the data received over UART] */

/**@snippet [UART Initialization] */
static void uart_init(void)
{
    uint32_t                     err_code;
    const app_uart_comm_params_t comm_params =
    {
        RX_PIN_NUMBER,
        TX_PIN_NUMBER,
        RTS_PIN_NUMBER,
        CTS_PIN_NUMBER,
        APP_UART_FLOW_CONTROL_DISABLED,
        false,
        UART_BAUDRATE_BAUDRATE_Baud115200
    };

    APP_UART_FIFO_INIT( &comm_params,
                       UART_RX_BUF_SIZE,
                       UART_TX_BUF_SIZE,
                       uart_event_handle,
                       APP_IRQ_PRIORITY_LOWEST,
                       err_code);
    APP_ERROR_CHECK(err_code);
}


#ifdef NEW_MAC_ADDRESS_TEST
/**@brief Function for searching a given addr in the advertisement packets.
 *
 * @details Use this function to parse received advertising data and to find a given
 * addr in them.
 *
 * @param[in]   p_adv_report   advertising data to parse.
 * @param[in]   p_addr   name to search.
 * @return   true if the given name was found, false otherwise.
 */
static bool find_peer_addr(const ble_gap_evt_adv_report_t *p_adv_report, const ble_gap_addr_t * p_addr)
{
    if (p_addr->addr_type == p_adv_report->peer_addr.addr_type)
    {
        if (memcmp(p_addr->addr, p_adv_report->peer_addr.addr, sizeof(p_adv_report->peer_addr.addr)) == 0)
        {
            return true;
        }
    }
    return false;
}
#endif


/**@snippet [UART Initialization] */

/**@brief Function for handling the advertising report BLE event.
 *
 * @param[in] p_ble_evt  Bluetooth stack event.
 */
static void on_adv_report(const ble_evt_t * const p_ble_evt)
{
    uint32_t      err_code;
    uint8_array_t adv_data;
    uint8_array_t dev_name;
    bool          do_connect = false;

    // For readibility.
    const ble_gap_evt_t * const p_gap_evt    = &p_ble_evt->evt.gap_evt;
    const ble_gap_addr_t  * const peer_addr  = &p_gap_evt->params.adv_report.peer_addr;
    const ble_gap_evt_adv_report_t * p_adv_report = &p_gap_evt->params.adv_report;

#ifndef NEW_MAC_ADDRESS_TEST

    //Initialize advertisement report for parsing
    adv_data.p_data = (uint8_t *)p_gap_evt->params.adv_report.data;
    adv_data.size   = p_gap_evt->params.adv_report.dlen;


    //search for advertising names
    bool found_name = false;
    err_code = adv_report_parse(BLE_GAP_AD_TYPE_COMPLETE_LOCAL_NAME,
                                &adv_data,
                                &dev_name);
    if (err_code != NRF_SUCCESS)
    {
        // Look for the short local name if it was not found as complete
        err_code = adv_report_parse(BLE_GAP_AD_TYPE_SHORT_LOCAL_NAME, &adv_data, &dev_name);
        if (err_code != NRF_SUCCESS)
        {
            // If we can't parse the data, then exit
            return;
        }
        else
        {
            found_name = true;
        }
    }
    else
    {
        found_name = true;
    }
    
    if (found_name)
    {
        if (strlen(m_target_periph_name) != 0)
        {
            if (memcmp(m_target_periph_name, dev_name.p_data, dev_name.size) == 0)
            {
                do_connect = true;
            }
        }
    }

#else
    if (find_peer_addr(&p_gap_evt->params.adv_report, &m_target_periph_addr)) {
        NRF_LOG_INFO("Address match send connect_request.\r\n");
        do_connect = true;
    }
#endif
    if (do_connect)
    {
        // Initiate connection.
        err_code = sd_ble_gap_connect(peer_addr, &m_scan_params, &m_connection_param);
        if (err_code != NRF_SUCCESS)
        {
            NRF_LOG_ERROR("Connection Request Failed, reason %d\r\n", err_code);
        } else {
                    NRF_LOG_INFO("Connecting to target %02x%02x%02x%02x%02x%02x\r\n",
                             p_adv_report->peer_addr.addr[0],
                             p_adv_report->peer_addr.addr[1],
                             p_adv_report->peer_addr.addr[2],
                             p_adv_report->peer_addr.addr[3],
                             p_adv_report->peer_addr.addr[4],
                             p_adv_report->peer_addr.addr[5]);
				}

